# Import Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Document..::..Import Method
Document Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Import(String, GBXMLImportOptions) | Imports a Green-Building XML file into the document. |
| Import(String, AXMImportOptions, View) | Imports an AXM file into the document. |
| Import(String, ImportOptions3DM, View) | Imports a 3DM file into the document. |
| Import(String, OBJImportOptions, View) | Imports an OBJ file into the document. |
| Import(String, SATImportOptions, View) | Imports an SAT file into the document. |
| Import(String, SKPImportOptions, View) | Imports a SKP file into the document. |
| Import(String, STLImportOptions, View) | Imports an STL file into the document. |
| Import(String, DGNImportOptions, View, ElementId%) | Imports a DGN file to the document. |
| Import(String, DWGImportOptions, View, ElementId%) | Imports a DWG or DXF file to the document. |

# See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace